OFsolvers/tutorial_cases/bubble_colum_pbe_20L/0.orig/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "${FOAM_CASE}/constant/globalVars"

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"  

    inlet
    {
        //type            flowRateInletVelocity;
        //massFlowRate    $mflowRateLiq;
        //rho             thermo:rho.liquid;
        //value           $internalField;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            noSlip;
    }

}

// ************************************************************************* //
